Revit 2027 API
Wave.WaveNumWaveSets Property
 The property labeled "Number" from the "Wave" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WaveNumWaveSets { get; }
Public Shared ReadOnly Property WaveNumWaveSets As String
	Get
public:
static property String^ WaveNumWaveSets {
	String^ get ();
}
static member WaveNumWaveSets : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" within the range of "1, 50".
See Also
Reference
Wave Class
Autodesk.Revit.DB.Visual Namespace